[
    {
        "title": "The Heaven & Earth Grocery Store", 
        "author": "James McBride", 
        "description": "THE RUNAWAY NEW YORK TIMES BESTSELLER A NEW YORK TIMES NOTABLE BOOK FROM ONE OF TIME MAGAZINE'S 100 MOST INFLUENTIAL PEOPLE OF 2024 NAMED A BEST BOOK OF THE YEAR BY NPR/FRESH AIR, WASHINGTON POST, THE NEW YORKER, AND TIME MAGAZINE ONE OF BARACK OBAMA'S FAVORITE BOOKS OF 2023 “A murder mystery locked inside a Great American Novel . . . Charming, smart, heart-blistering, and heart-healing.” —Danez Smith, The New York Times Book Review “We all need—we all deserve—this vibrant, love-affirming novel that bounds over any difference that claims to separate us.” —Ron Charles, The Washington Post From James McBride, author of the bestselling Oprahs Book Club pick Deacon King Kong and the National Book Award winning The Good Lord Bird, a novel about small-town secrets and the people who keep them In 1972, when workers in Pottstown, Pennsylvania, were digging the foundations for a new development, the last thing they expected to find was a skeleton at the bottom of a well. Who the skeleton was and how it got there were two of the long-held secrets kept by the residents of Chicken Hill, the dilapidated neighborhood where immigrant Jews and African Americans lived side by side and shared ambitions and sorrows. Chicken Hill was where Moshe and Chona Ludlow lived when Moshe integrated his theater and where Chona ran the Heaven & Earth Grocery Store. When the state came looking for a deaf boy to institutionalize him, it was Chona and Nate Timblin, the Black janitor at Moshes theater and the unofficial leader of the Black community on Chicken Hill, who worked together to keep the boy safe. As these characters stories overlap and deepen, it becomes clear how much the people who live on the margins of white, Christian America struggle and what they must do to survive. When the truth is finally revealed about what happened on Chicken Hill and the part the towns white establishment played in it, McBride shows us that even in dark times, it is love and community—heaven and earth—that sustain us. Bringing his masterly storytelling skills and his deep faith in humanity to The Heaven & Earth Grocery Store, James McBride has written a novel as compassionate as Deacon King Kong and as inventive as The Good Lord Bird."}, 
    {
        "title": "Poverty, By America", 
        "author": "Matthew Desmond", 
        "description": "THE NEW YORK TIMES BESTSELLER ONE OF BARACK OBAMA'S FAVOURITE BOOKS OF 2023 A searing study of American poverty from the Pulitzer Prize-winning author of Evicted The United States is the richest country on earth, yet has more poverty than any other advanced democracy. One in seven Americans live below the poverty line, a line which hasn't shifted over the last fifty years, despite the efforts of successive governments. Why is there so much scarcity in this land of dollars? In Poverty, by America, acclaimed sociologist Matthew Desmond examines American poverty today and the stories we tell ourselves about it. Spanning social isolation, mass incarceration, the housing crisis, domestic violence, crack and opioid epidemics, welfare cuts and more, Desmond argues that poverty does not result from a lack of resources or good policy ideas. We already know how to eliminate it. The hard part is getting more of us to care. To do so, we need a new story. As things stand, liberals explain poverty through insurmountable structural issues, whereas conservatives highlight personal failings and poor life choices. Both abdicate responsibility, and ignore the reality that the advantages of the rich only come at the expense of the poor. It is time better-paid citizens put themselves back in the narrative, recognizing that the depth and expanse of poverty in any nation reflects our failure to look out for one another. Poverty must ultimately be met by community: all this suffering and want is our doing, and we can undo it."}, 
    {
        "title": "How to Say Babylon", 
        "author": "Safiya Sinclair", 
        "description": "'National Book Critics Circle Award Winner A New York Times Notable Book A Read with Jenna Today Show Book Club Pick! A Best Book of 2023 by the New York Times, Time, The Washington Post, Vulture, Shelf Awareness, Goodreads, Esquire, The Atlantic, NPR, and Barack Obama With echoes of Educated and Born a Crime, How to Say Babylon is the stunning story of the author struggle to break free of her rigid Rastafarian upbringing, ruled by her fathers strict patriarchal views and repressive control of her childhood, to find her own voice as a woman and poet. Throughout her childhood, Safiya Sinclairs father, a volatile reggae musician and militant adherent to a strict sect of Rastafari, became obsessed with her purity, in particular, with the threat of what Rastas call Babylon, the immoral and corrupting influences of the Western world outside their home. He worried that womanhood would make Safiya and her sisters morally weak and impure, and believed a womans highest virtue was her obedience. In an effort to keep Babylon outside the gate, he forbade almost everything. In place of pants, the women in her family were made to wear long skirts and dresses to cover their arms and legs, head wraps to cover their hair, no make-up, no jewelry, no opinions, no friends. Safiyas mother, while loyal to her father, nonetheless gave Safiya and her siblings the gift of books, including poetry, to which Safiya latched on for dear life. And as Safiya watched her mother struggle voicelessly for years under housework and the rigidity of her fathers beliefs, she increasingly used her education as a sharp tool with which to find her voice and break free. Inevitably, with her rebellion comes clashes with her father, whose rage and paranoia explodes in increasing violence. As Safiyas voice grows, lyrically and poetically, a collision course is set between them. How to Say Babylon is Sinclairs reckoning with the culture that initially nourished but ultimately sought to silence her; it is her reckoning with patriarchy and tradition, and the legacy of colonialism in Jamaica. Rich in lyricism and language only a poet could evoke, How to Say Babylon is both a universal story of a woman finding her own power and a unique glimpse into a rarefied world we may know how to name, Rastafari, but one we know little about.'"}, 
    {
        "title": "The Wager: A Tale of Shipwreck, Mutiny and Murder", 
        "author": "David Grann", 
        "description": "From the international bestselling author of KILLERS OF THE FLOWER MOON and THE LOST CITY OF Z, a mesmerising story of shipwreck, mutiny and murder, culminating in a court martial that reveals a shocking truth. On 28th January 1742, a ramshackle vessel of patched-together wood and cloth washed up on the coast of Brazil. Inside were thirty emaciated men, barely alive, and they had an extraordinary tale to tell. They were survivors of His Majestys ship the Wager, a British vessel that had left England in 1740 on a secret mission during an imperial war with Spain. While chasing a Spanish treasure-filled galleon, the Wager was wrecked on a desolate island off the coast of Patagonia. The crew, marooned for months and facing starvation, built the flimsy craft and sailed for more than a hundred days, traversing 2,500 miles of storm-wracked seas. They were greeted as heroes. Then, six months later, another, even more decrepit, craft landed on the coast of Chile. This boat contained just three castaways and they had a very different story to tell. The thirty sailors who landed in Brazil were not heroes, they were mutineers. The first group responded with counter-charges of their own, of a tyrannical and murderous captain and his henchmen. While stranded on the island the crew had fallen into anarchy, with warring factions fighting for dominion over the barren wilderness. As accusations of treachery and murder flew, the Admiralty convened a court martial to determine who was telling the truth. The stakes were life-and-death—for whomever the court found guilty could hang."}, 
    {
        "title": "Chip War", 
        "author": "Chris Miller", 
        "description": "***Winner of the 2022 Financial Times Business Book of the Year Award*** ***Selected as one of Barack Obama's Favourite Books of 2023*** 'Pulse quickening. A nonfiction thriller - equal parts The China Syndrome and Mission Impossible' New York Times An epic account of the decades-long battle to control the world's most critical resource—microchip technology Power in the modern world - military, economic, geopolitical - is built on a foundation of computer chips. America has maintained its lead as a superpower because it has dominated advances in computer chips and all the technology that chips have enabled. (Virtually everything runs on chips: cars, phones, the stock market, even the electric grid.) Now that edge is in danger of slipping, undermined by the naïve assumption that globalising the chip industry and letting players in Taiwan, Korea and Europe take over manufacturing serves America's interests. Currently, as Chip War reveals, China, which spends more on chips than any other product, is pouring billions into a chip-building Manhattan Project to catch up to the US. In Chip War economic historian Chris Miller recounts the fascinating sequence of events that led to the United States perfecting chip design, and how faster chips helped defeat the Soviet Union (by rendering the Russians arsenal of precision-guided weapons obsolete). The battle to control this industry will shape our future. China spends more money importing chips than buying oil, and they are China's greatest external vulnerability as they are fundamentally reliant on foreign chips. But with 37 per cent of the global supply of chips being made in Taiwan, within easy range of Chinese missiles, the West's fear is that a solution may be close at hand. 'A riveting history. Features vivid accounts and colourful characters' Financial Times 'Fascinating … A historian by training, Miller walks the reader through decades of semiconductor history , a subject that comes to life thanks to [his] use of colorful anecdotes' Forbes 'Indispensable' Niall Ferguson"}, 
    {
        "title": "The Vaster Wilds", 
        "author": "Lauren Groff", 
        "description": "A profound and explosive novel about a spirited girl alone in the wilderness, trying to survive A servant girl escapes from a settlement. She carries nothing with her but her wits, a few possessions, and the spark of god that burns hot within her. What she finds is beyond the limits of her imagination and will bend her belief of everything that her own civilization has taught her. The Vaster Wilds is a work of raw and prophetic power that tells the story of America in miniature, through one girl at a hinge point in history, to ask how -and if - we can adapt quickly enough to save ourselves. Praise for MATRIX: 'Lush, gripping and ferocious' MADELINE MILLER 'Full of passion, wisdom and magic' SARAH WATERS 'Gorgeous, sensual, addictive' SARA COLLINS 'Brightly lit' NAOMI ALDERMAN 'A propulsive, captivating read' BRIT BENNETT 'Fascinating, beguiling, vivid' MARIAN KEYES"}, 
    {
        "title": "Humanly Possible", 
        "author": "Sarah Bakewell", 
        "description": "If you are reading this, you may already be a humanist. Even if you don't know know it. Do you love literature and the arts? Do you have a strong moral compass despite not being formally religious? Do you simply believe that individual lives are more important than grand political visions? If any of these apply, you are part of a long tradition of humanist thought. In Humanly Possible, Sarah Bakewell asks what humanism is and why it has flourished for so long. By introducing us to adventurous lives and ideas of famous humanists throughout 700 years of history, she shows how the humanist values that helped steer us through dark times in the past are just as urgently needed in our world today."}, 
    {
        "title": "King: A Life", 
        "author": "Jonathan Eig", 
        "description": "WINNER OF THE 2024 PULITZER PRIZE FOR BIOGRAPHY A finalist for the 2023 National Book Critics Circle Award | Named one of the ten best books of 2023 by The Washington Post, Chicago Tribune, and Time A New York Times bestseller and notable book of 2023 | One of Barack Obama's favorite books of 2023 One of The New Yorker's essential reads of 2023 | A Christian Science Monitor best book of the year | One of Air Mail's twelve best books of 2023 A Washington Post and National Indie Bestseller | One of Publishers Weekly's best nonfiction books of 2023 | One of Smithsonian magazine's ten best books of 2023 “Supple, penetrating, heartstring-pulling and compulsively readable . . . Eigs book is worthy of its subject.” —Dwight Garner, The New York Times (Editors Choice) “[King is] infused with the narrative energy"
    }
]