[
      {
        "title": "Night Watch",
        "author": "Jayne Anne Phillips",
        "description": "A beautifully rendered novel set in West Virginia's Trans-Allegheny Lunatic Asylum in the aftermath of the Civil War where a severely wounded Union veteran, a 12-year-old girl and her mother, long abused by a Confederate soldier, struggle to heal.",
        "category": "Fiction"
      },
      {
        "title": "King: A Life",
        "author": "Jonathan Eig",
        "description": "A revelatory portrait of Martin Luther King, Jr. that draws on new sources to enrich our understanding of each stage of the civil rights leader's life, exploring his strengths and weaknesses, including the self-questioning and depression that accompanied his determination.",
        "category": "Biography"
      },
      {
        "title": "Master Slave Husband Wife: An Epic Journey from Slavery to Freedom",
        "author": "Ilyon Woo",
        "description": "A rich narrative of the Crafts, an enslaved couple who escaped from Georgia in 1848, with light-skinned Ellen disguised as a disabled white gentleman and William as her manservant, exploiting assumptions about race, class and disability to hide in public on their journey to the North, where they became famous abolitionists while evading bounty hunters.",
        "category": "Biography"
      },
      {
        "title": "Liliana's Invincible Summer: A Sister's Search for Justice",
        "author": "Cristina Rivera Garza",
        "description": "A genre-bending account of the author's 20-year-old sister, murdered by a former boyfriend, that mixes memoir, feminist investigative journalism and poetic biography stitched together with a determination born of loss.",
        "category": "Memoir or Autobiography"
      },
      {
        "title": "A Day in the Life of Abed Salama: Anatomy of a Jerusalem Tragedy",
        "author": "Nathan Thrall",
        "description": "A finely reported and intimate account of life under Israeli occupation of the West Bank, told through a portrait of a Palestinian father whose five-year-old son dies in a fiery school bus crash when Israeli and Palestinian rescue teams are delayed by security regulations.",
        "category": "Memoir or Autobiography"
      }
      
    ]